Revit 2026 API

# ElementSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
ElementSetIterator()
```
```fsharp
new : unit -> ElementSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

ElementSetIterator Class

Autodesk.Revit.DB Namespace